Reports/ЦелевыеВходящиеЗвонкиПоКлассифайдам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Report>
		<Properties>
			<Name>ЦелевыеВходящиеЗвонкиПоКлассифайдам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИерархияСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Иерархия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сайт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЦелевыеЗвонки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сигнатура</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/ЦелевыеВходящиеЗвонкиПоКлассифайдам/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	
	ТекДата = ТекущаяДата();
	ТекПериод = Новый СтандартныйПериод();
	ТекПериод.ДатаНачала 	= НачалоМесяца(ТекДата);
	ТекПериод.ДатаОкончания = ТекДата;	
	ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период" ,ТекПериод);
	
	СписокКаналов = Новый Массив();
	Для Каждого Зап Из Отчет.Иерархия Цикл
	    СписокКаналов.Добавить(Зап.Сайт);
	КонецЦикла;

	ПустаяСсылка = ПредопределенноеЗначение("Справочник.ТелВнешние.ПустаяСсылка");	
	Каналы = Новый Массив();
	Для Каждого Эл Из СписокКаналов Цикл
		Канал = Справочники.ТелВнешние.НайтиПоКоду(Эл);
		Если Канал = ПустаяСсылка Тогда
			Сообщить("Не найден канал: " +Эл);
			Продолжить;
		КонецЕсли;
		Каналы.Добавить(Канал);
	КонецЦикла;	
	Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Каналы" ,Каналы);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ЭтаФорма.СкомпоноватьРезультат();
	//ЭтаФормаРезультат);
	//ЭтаФорма.Отчет.ск
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИерархию(Команда)
	//ОткрытьФорму("Отчет.ПрогнозЗадачПоИнтернетЗаявкам.Форма.Иерархия");	
	//ОткрытьФорму("ВнешнийОтчет.ЦелевыеВходящиеЗвонкиПоКлассифайдам.Форма.Иерархия");
	ОткрытьФорму("Отчет.ЦелевыеВходящиеЗвонкиПоКлассифайдам.Форма.Иерархия");	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Прочитать иерархию
	//-------------------	
	Парам = Новый Структура();
	Парам.Вставить("Отчет_ЦелевыеВходящиеЗвонкиПоКлассифайдам_Иерархия");
	РегистрыСведений.УчетнаяПолитика.Получи(Парам);
	
	Если Не ЗначениеЗаполнено(Парам["Отчет_ЦелевыеВходящиеЗвонкиПоКлассифайдам_Иерархия"]) Тогда
		Возврат
	Иначе
		ПрочитатьИерархию(Парам["Отчет_ЦелевыеВходящиеЗвонкиПоКлассифайдам_Иерархия"]);
		ЭтаФорма.отчет.ИерархияСтрокой = Парам["Отчет_ЦелевыеВходящиеЗвонкиПоКлассифайдам_Иерархия"];
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПрочитатьИерархию(Стр)
	
	Отчет.Иерархия.Очистить();
	
	Чт = Новый ЧтениеXML();
	Чт.УстановитьСтроку(Стр);
	Постр = Новый ПостроительDOM();
	Док = Постр.Прочитать(Чт);
	
	Корень = Док.ДочерниеУзлы[0];
	Для Каждого Ряд Из Корень.ДочерниеУзлы Цикл
			Новая = ЭтаФорма.Отчет.Иерархия.Добавить();
			Новая.Группа 	= Ряд.ДочерниеУзлы[0].ДочерниеУзлы[0].ТекстовоеСодержимое;
			Новая.Сайт 		= Ряд.ДочерниеУзлы[1].ДочерниеУзлы[0].ТекстовоеСодержимое;
	КонецЦикла;
КонецФункции
